#!/usr/local/bin/python3
#아래 주어진 데이터들로부터 중복을 제거하여 실제 접수 인원을 출력해 주세요.
"""
set()함수 - 중복 값 제거, 순서대로 정렬됨
people = [
             ('이호준', '01050442903'),
             ('이호상', '01051442904'),
             ('이준호', '01050342904'),
             ('이호준', '01050442903'),
             ('이준', '01050412904'),
             ('이호', '01050443904'),
             ('이호준', '01050442903'),
             ]

i = 0
a = 1
for i in range(len(people)):
    while a !=len(people):
        if people[i] == people[a]:
           del people[a]
        elif people[i] != people[a] and a !=len(people) :
           a +=1
    i += 1
for i in people:
   print(i)
print("total : ",len(people)) 
---------------------------
"""
people = [
         ('이호준', '01050004429'),
         ('이호상', '01051442904'),
         ('이준호', '01050003429'),
         ('이호준', '01050004429'),
         ('이준', '01050412904'),
         ('이호', '0105000443904'),
         ('이호준', '01050004429'),
         ]

print(len(set(people)))

